

public class structure {

    /*
        Video.js — это видеоплеер с открытым исходным кодом, библиотека на языках CSS и JavaScript,
          разработанная для облегчения работы по созданию HTML5-видео.
        Она позволяет создавать и изменять внешний вид плеера, редактировать его отображение в разных браузерах,
          встраивать видеоданные на страницу интернет-сайта с помощью тега по аналогии с добавлением изображений.
        Технология даёт возможность воспроизводить видео в полноэкранном режиме, добавлять субтитры,
          переключаться на Flash в случае недоступности HTML5, взаимодействовать с видео с помощью JavaScript API.

        1. На странице dash видеопроигрователя интегрировать библиотеку Video.js.
        2. С сервера Nginx подътянуть видео файлы, для возпроизведения видео контента.
        3. ...
    */

    class DashController{


        String dash(){ return "content"; }
    }
}
